2023-ICTMentoring/Vest-firmware/MAST_NUC130_Code/FDe_Project_Master_V21_chosungError/NUC130LC1CN.c
/*	Purpose : AER(ARM Embedded RTOS) Project
	Target Name : E3355-T11
	Compiler : MDK-ARM Compiler V5
	CMSIS : NUC130_CMSIS302_LIBRARY
	Document : xxxx_.txt
	Information :
	- dot led 8*8 Workig
	- each 9 ea
	- Max7219
	---------------------------------------------------------------
	Copyright by FirmwareBank Inc,. All Rights Reserved. */

// Cortex-M0 NUC130 Main Board Embedded Project Code

#include "NUC130LC1CN.h"

struct ring
{
	volatile unsigned long wp;
	volatile unsigned long rp;
	volatile unsigned char buffer[QSIZE];
	volatile unsigned char get_char;
};
// struct ring lcd;					// for ring buffer for UART0
struct ring rf;	 // for ring buffer for UART1
struct ring usb; // for ring buffer for UART2

struct time_value
{
	volatile unsigned long ledred_off, ledblue_off, buzzer_off;
	volatile unsigned long com_check_usb, com_check_rf;
};
struct time_value time;

struct project{
	volatile unsigned short keyboard_adc;
	char key_now, key_temp;

	volatile unsigned char gamemode, gamemode_sw;
	unsigned char senddata[10];
	unsigned char rfadd, rfcommand, rfreaddata[20];
	unsigned short KEY[13]; // key board 1~12
	unsigned char student_attend[MAX_ATTEND];// MAX_ATTEND, #define MAX_ATTEND		20// 최대 학생수, 참가자 출석표 작성
	unsigned char student_att_exit;
	unsigned char howmanystudent; // attend 학생수
	unsigned long timeout_sec;// timeout
	unsigned char student_OX_check;
	unsigned char student_chosung_font[16];	
	unsigned char key_lcd_position;
	unsigned char while_event;
	
	unsigned char ucpass; // use general
};
struct project run;

struct com_uart
{
	volatile unsigned long comtimeout;
	volatile unsigned char get_char;
	volatile unsigned char sequence;
	volatile unsigned char count;
	volatile unsigned char len;
	volatile unsigned char sum;
	unsigned char readdata[10];

	volatile unsigned char command;
	volatile unsigned char add;
	char textlcd[16];
};
struct com_uart mast;

// General Value
unsigned long ulpass;
unsigned short uspass;
unsigned char ucpass;
char cpass;
unsigned long runflag;

// timer
volatile unsigned long timer0tick, timer1tick; //, timer2tick; // Timer Value.

#define UART_LCD 	UART0
#define UART_RF 	UART1
#define UART_USB 	UART2

#define CODE_VERSION	23
int i,j;
// Project, Running
int main(void){
	setup();

	UART_Open(UART_LCD, 9600); //
	UART_Open(UART_RF, 9600);  // mast <-> student
	UART_Open(UART_USB, 9600); //

	ring_ini_rf();
	ring_ini_usb();

	// for LCD ini wating 5 Sec
	LEDRF(1);
	LEDBF(1);
	time1_delay(TM_2SEC);
	LEDRF(0);
	LEDBF(0);
	
	// key in Boot is rf <==> USB com toss
//	if (IN15 == 0){		  // in key
//		auto_off('Z', TM_1000mS); // Buzzer ON and auto off
//		while (23)
//		{
//			// COM Pass
//			usb2rf();
//			rf2usb();
//		}
//	}

	// TEXT LCD initial
	UART_WRITE(UART_LCD, 0xFB); // First
	UART_WRITE(UART_LCD, 0xD3); // 1101 0011 BackLight ON
	UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear

	//UART_WRITE(UART_LCD, 0x90); // Format : 10yy xxxx(6bit Course position)   x=0, y=1, at position
	strcpy(mast.textlcd, "     Welcome    ");	// max 16 char	
	//Module_LCD_string(0, 1, mast.textlcd);
	
	// version display
	mast.textlcd[13] = 'V';
	mast.textlcd[14] = (CODE_VERSION/10) + 0x30;
	mast.textlcd[15] = (CODE_VERSION - ((mast.textlcd[14]-0x30)*10)) + 0x30;
	Module_LCD_string(0, 1, mast.textlcd);
	
	strcpy(mast.textlcd, "Jokki Jokki Game");	// max 16 char	
	Module_LCD_string(0, 2, mast.textlcd);
	
	time1_delay(TM_3SEC);
	UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear
	
	//textLCD_string(mast.textlcd);
	auto_off('R', TM_100mS); // Buzzer ON and auto off

	// Software ini
	run.gamemode_sw = run.gamemode = GM_DEFAULT * 10; // first is zero

	// Key board Setting
	run.keyboard_adc = 2901;//basic oper adc_read(ADC_KEY_CH, 32) by jtag no KEY
	run_keyboard_define(run.keyboard_adc);
	
	while (2){// make game	
		
		// PC <====> Student
		usb2rf();
		//rf2usb();
		
		run_game_mode(); // case run.gamemode_sw
		
		if (isflag(F_IN15_BUTTON)){
			// key board Calibration
			run.keyboard_adc = adc_read(ADC_KEY_CH, 32);// 2901; by jtag no KEY
			run_keyboard_define(run.keyboard_adc);
			
			// Hardware, OUT
			LEDRF(1);
			LEDBF(1);
			BUZZERF(1);
			time0_delay(TM_1000mS);

			LEDRF(0);
			LEDBF(0);
			BUZZERF(0);
			clrflag(F_IN15_BUTTON);
		}
	} // end while
}

void setup(void)
{
	SYS_UnlockReg();
	CLK_EnableXtalRC(CLK_PWRCON_OSC22M_EN_Msk);
	CLK_WaitClockReady(CLK_CLKSTATUS_IRC22M_STB_Msk);
	CLK_SetHCLK(CLK_CLKSEL0_HCLK_S_HIRC, CLK_CLKDIV_HCLK(1));

	// Enable IP clock
	CLK_EnableModuleClock(TMR0_MODULE);
	CLK_EnableModuleClock(TMR1_MODULE);
	CLK_EnableModuleClock(UART0_MODULE);
	CLK_EnableModuleClock(UART1_MODULE);
	CLK_EnableModuleClock(UART2_MODULE);
	CLK_EnableModuleClock(ADC_MODULE);

	CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0_S_HIRC, 0);
	CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1_S_HIRC, 0);
	CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_CLKDIV_UART(1)); // CLK_CLKSEL1_UART_S_HIRC
	CLK_SetModuleClock(UART1_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_CLKDIV_UART(1)); // CLK_CLKSEL1_UART_S_HIRC
	CLK_SetModuleClock(UART2_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_CLKDIV_UART(1)); // CLK_CLKSEL1_UART_S_HIRC
	CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL1_ADC_S_HIRC, CLK_CLKDIV_ADC(10));	   // CLK_CLKSEL1_ADC_S_HIRC

	SystemCoreClockUpdate();
	SYS_LockReg();

	SYS->ALT_MFP = 0x00000000;
	SYS->ALT_MFP1 = 0x00000000;
	SYS->ALT_MFP2 = 0x00000000;

	// Port A
	// SYS->GPA_MFP = 0;
	SYS->GPA_MFP = SYS_GPA_MFP_PA5_ADC5;

	// Port B
	// SYS->GPB_MFP = 0;
	SYS->GPB_MFP |= SYS_GPB_MFP_PB0_UART0_RXD | SYS_GPB_MFP_PB1_UART0_TXD | SYS_GPB_MFP_PB4_UART1_RXD | SYS_GPB_MFP_PB5_UART1_TXD;

	// Port C
	SYS->GPC_MFP = 0;

	// Port D
	// SYS->GPD_MFP = 0;
	SYS->GPD_MFP = SYS_GPD_MFP_PD14_UART2_RXD | SYS_GPD_MFP_PD15_UART2_TXD;

	// LED Red, blue
	GPIO_SetMode(PA, BIT6 | BIT7, GPIO_PMD_OUTPUT);

	// Buttons
	GPIO_SetMode(PB, BIT15 | BIT8, GPIO_PMD_QUASI);

	// Buzzer
	GPIO_SetMode(PA, BIT12, GPIO_PMD_OUTPUT);

	// RFCON
	GPIO_SetMode(PA, BIT8, GPIO_PMD_OUTPUT);
	RFSETPORT(0); // 1 is Com MODE

	// Timer
	TIMER_Open(TIMER0, TIMER_PERIODIC_MODE, 100); // 10mS
	TIMER_EnableInt(TIMER0);
	NVIC_EnableIRQ(TMR0_IRQn); // TMR0_IRQHandler
	TIMER_Start(TIMER0);

	TIMER_Open(TIMER1, TIMER_PERIODIC_MODE, 1); //  1 Sec
	TIMER_EnableInt(TIMER1);
	NVIC_EnableIRQ(TMR1_IRQn); // TMR1_IRQHandler
	TIMER_Start(TIMER1);

