2023-ICTMentoring/Vest-firmware/MAST_NUC130_Code/FDe_Project_Master_V21_chosungError/NUC130LC1CN.c
	// UART
	UART_ENABLE_INT(UART1, (UART_IER_RDA_IEN_Msk | UART_IER_TOUT_IEN_Msk));
	NVIC_EnableIRQ(UART1_IRQn); // UART_IRQHandler

	//	UART_EnableInt(UART0,(UART_IER_RDA_IEN_Msk | UART_IER_TOUT_IEN_Msk));
	// NVIC_EnableIRQ(UART02_IRQn);	//UART_IRQHandler

	UART_EnableInt(UART2, (UART_IER_RDA_IEN_Msk | UART_IER_TOUT_IEN_Msk));
	NVIC_EnableIRQ(UART02_IRQn); // UART_IRQHandler

	// ADC
	ADC_Open(ADC, ADC_ADCR_DIFFEN_SINGLE_END, ADC_ADCR_ADMD_SINGLE, (1 << 5)); // adc5==> KEY BD12
	ADC_POWER_ON(ADC);
}

// Interrupt   ----------------------------------

// UART02_IRQn
void UART02_IRQHandler(void)
{ // UART0_IRQHandler
	//	uint32_t u32IntSts0 = UART0->ISR;
	uint32_t u32IntSts2 = UART2->ISR;

	//	if(u32IntSts0 & UART_ISR_RDA_INT_Msk) {
	//		while(!UART_GET_RX_EMPTY(UART0)){
	//			lcd.buffer[lcd.wp]= UART_READ(UART0);
	//			lcd.wp++;
	//			if(lcd.wp > QSIZE) lcd.wp=0;
	//			}
	//	}

	if (u32IntSts2 & UART_ISR_RDA_INT_Msk)
	{
		while (!UART_GET_RX_EMPTY(UART2))
		{
			usb.buffer[usb.wp] = UART_READ(UART2);
			usb.wp++;
			if (usb.wp > QSIZE)
				usb.wp = 0;
		}
	}
}

// uart1
void UART1_IRQHandler(void)
{ // UART1_IRQHandler

	uint32_t u32IntSts = UART1->ISR;

	if (u32IntSts & UART_ISR_RDA_INT_Msk)
	{
		while (!UART_GET_RX_EMPTY(UART1))
		{
			rf.buffer[rf.wp] = UART_READ(UART1);
			rf.wp++;
			if (rf.wp > QSIZE)
				rf.wp = 0;
		}
	}
}

void TMR0_IRQHandler(void){ // 10ms
	TIMER_ClearIntFlag(TIMER0);
	timer0tick++;
	
	if(isflag(F_STU_READ_TIMECHK)){ // 학생들에게 데이터 요청후 수신 대기 시간
		time.com_check_rf--;
		if(time.com_check_rf == 0){
			clrflag(F_STU_READ_TIMECHK);
			run.student_att_exit = 0; // endless loop exit timer
		}		
	}

	if (IN15 == 0) setflag(F_IN15_BUTTON); // calibration button

	if (isflag(F_KEYBD_READ_OK)){
		run.key_temp = run_keyboard_adc_return(adc_read(ADC_KEY_CH, 32));
		if(run.key_temp){
			run.key_now = run.key_temp;
			setflag(F_ADC_BUTTON);
		}
	}			

	if (isflag(F_BUZZER_AUTOOFF))	{
		time.buzzer_off--;
		if (time.buzzer_off == 0)	{
			BUZZERF(0);
			clrflag(F_BUZZER_AUTOOFF);
		}
	}

	if (isflag(F_LEDB_AUTOOFF))
	{
		time.ledblue_off--;
		if (time.ledblue_off == 0)
		{
			LEDBF(0);
			clrflag(F_LEDB_AUTOOFF);
		}
	}

	if (isflag(F_LEDR_AUTOOFF))
	{
		time.ledred_off--;
		if (time.ledred_off == 0)
		{
			LEDRF(0);
			clrflag(F_LEDR_AUTOOFF);
		}
	}
}
// Interrupt   ----------------------------------

void TMR1_IRQHandler(void){ //  1sec
	TIMER_ClearIntFlag(TIMER1);
	timer1tick++;
	
	GPIO_TOGGLE(LEDBP);
	
	if(isflag(F_TIMEOUT_CHK_ING)){// time out start
		run.timeout_sec--;
		if(run.timeout_sec == 0){
			clrflag(F_TIMEOUT_CHK_ING); // time out start
			setflag(F_TIMEOUT_OVER);
		}
	}
}

void time0_delay(unsigned long T0)
{
	timer0tick = 0;
	while (timer0tick < T0)
		;
}

void time1_delay(unsigned long T1)
{
	timer1tick = 0;
	while (timer1tick < T1)
		;
}

// Utility Function ====================================
unsigned long isflag(unsigned long flag)
{
	return (runflag & flag);
}

void setflag(unsigned long flag)
{
	runflag |= flag;
}

void clrflag(unsigned long flag)
{
	runflag &= ~flag;
}

void auto_off(unsigned char hardware, unsigned long time_autooff)
{

	switch (hardware)
	{
	case 'B': // Blue LED
	case 'b':
		setflag(F_LEDB_AUTOOFF);
		time.ledblue_off = time_autooff;
		LEDBF(1);
		break;

	case 'R': // Red LED
	case 'r':
		setflag(F_LEDR_AUTOOFF);
		time.ledred_off = time_autooff;
		LEDRF(1);
		break;

	case 'Z': // Buzzer
	case 'z':
		setflag(F_BUZZER_AUTOOFF);
		time.buzzer_off = time_autooff;
		BUZZERF(1);
		break;
	}
}
// Utility Function ====================================

// UART 2222222222222222222222222222222222222222222222222222
void ring_ini_rf(void)
{
	rf.rp = 0;
	rf.wp = 0;
}

void ring_ini_usb(void)
{
	usb.rp = 0;
	usb.wp = 0;
}

unsigned char check_poprf(void)
{
	if (rf.wp != rf.rp)
	{
		rf.get_char = (rf.buffer[rf.rp]);
		rf.rp++; // Increment Read Point
		if (rf.rp > QSIZE)
			rf.rp = 0; // Read ��������
		return 1;
	} // end if
	return 0;
}

unsigned char check_popusb(void)
{ // software
	if (usb.wp != usb.rp)
	{
		usb.get_char = (usb.buffer[usb.rp]); // pop get char by check flag
		usb.rp++;							 // Increment Read Point
		if (usb.rp > QSIZE)
			usb.rp = 0; // Read ��������
		return 1;
	}
	return 0;
}

// UART 222222222222222222222222222222222222222222222222

// Project Function ====================================
// project
void usb2rf(void)
{
	if (check_popusb())
	{
		UART_WRITE(UART_RF, usb.get_char);
		auto_off('R', TM_200mS);
	}
}
void rf2usb(void)
{
	if (check_poprf())
	{
		UART_WRITE(UART_USB, rf.get_char);
		auto_off('B', TM_200mS);
	}
}

// LCD Module   ====================================
void Module_LCD_string(unsigned char x, unsigned char y, char *lcdstring16){
	unsigned char ipass;
	
	ipass = 0x80 | x | (y << 4); // 0x90); // Format : 10yy xxxx(6bit Course position)   x=0, y=1, at position
	UART_WRITE(UART_LCD, ipass);
	
	for (ipass = 0; lcdstring16[ipass] != '\0'; ipass++){ // Null('\0')
		UART_WRITE(UART_LCD, lcdstring16[ipass]);
	}
	
}

void Module_LCD_onebyte(unsigned char x, unsigned char y, char lcdbyte){
	unsigned char ipass;
	
	ipass = 0x80 | x | (y << 4); // 0x90); // Format : 10yy xxxx(6bit Course position)   x=0, y=1, at position
	UART_WRITE(UART_LCD, ipass);
	UART_WRITE(UART_LCD, lcdbyte);	
}

// LCD Module   ====================================

// ADC   ()()()()()()())))))))))))))))))))))))
unsigned short adc_read(unsigned char adcchannel, unsigned long avr){

	unsigned long i;
	unsigned long adc_sum = 0;

	ADC_SET_INPUT_CHANNEL(ADC, 1 << adcchannel);

	for (i = 0; i < avr; i++)
	{
		ADC_START_CONV(ADC);
		while (ADC_IS_BUSY(ADC))
			; // 1 ADC is busy
		adc_sum += ADC_GET_CONVERSION_DATA(ADC, adcchannel);
	}

	return (adc_sum / avr);
}
// ADC   ()()()()()()())))))))))))))))))))))))

// Project Function ====================================

// game mode play
void run_game_mode(void){
	int debug=0;
	switch(run.gamemode_sw){
		
		case 0 : //default start
			run.gamemode_sw =2;// x0 game
			break;
		
		case 1:// check and key board calibration and next manu
			if(isflag(F_ADC_BUTTON)){
				//if(run.key_now != run.key_old){
					//run.key_old = run.key_now;
					auto_off('Z', TM_200mS);
					Module_LCD_string(0, 2, "");				
					UART_WRITE(UART_LCD, run.key_now);
					//if(run.key_old == '4') run_function(FUC_ATTEND); //void run_function(unsigned char func);
					if(run.key_now == '5') {run_function(FUC_KEY_CAL); run.gamemode_sw=0;}
					if(run.key_now == '#') run.gamemode_sw++;// next// next run_function(FUC_KEY_CAL); 
				//}
				time0_delay(TM_200mS);
				clrflag(F_ADC_BUTTON);				
			}	
			break;
		
