2023-ICTMentoring/Vest-firmware/MAST_NUC130_Code/FDe_Project_Master_V21_chosungError/NUC130LC1CN.c
		case 2:
			run.gamemode_sw++;// next		
			UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear
			//strcpy(mast.textlcd, "4:Attend 5:KEYBD");		
			  strcpy(mast.textlcd, "4:XO     6:CHO  ");		
			Module_LCD_string(0, 1, mast.textlcd);
			setflag(F_KEYBD_READ_OK); // able read key board
			auto_off('Z', TM_500mS);
		
		// for lCD test
		//UART_WRITE(UART_LCD, 0xC7); //
		
			break;
		
		case 3:// xo game and cho
			if(isflag(F_ADC_BUTTON)){
				//if(run.key_now != run.key_old){
					//run.key_old = run.key_now;
					auto_off('Z', TM_200mS);
					Module_LCD_string(0, 2, "");				
					UART_WRITE(UART_LCD, run.key_now);
					if(run.key_now == '4') run.gamemode_sw = GM_XOGAME * 10;  // XO
					if(run.key_now == '6') run.gamemode_sw = GM_CHOSUNG	* 10; //GM_CHOSUNG * 10;  // cho
				//}
				time0_delay(TM_200mS);
				clrflag(F_ADC_BUTTON);				
			}	
			break;		
			
		// *************   Chosung Game  ****************
		case 30 : //chosung game Start, ini
			run.gamemode_sw++;// next		
			UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear
			//strcpy(mast.textlcd, "4:Attend 5:KEYBD");		
			strcpy(mast.textlcd, "7:Attend #:Next ");		
			Module_LCD_string(0, 1, mast.textlcd);
		
			// send game mode mast ==> student
			run_function(FUC_CHOSUNG);
			time0_delay(TM_500mS);	

			setflag(F_KEYBD_READ_OK); // able read key board
			auto_off('Z', TM_500mS);				
		break;

		case 31:// check
			if(isflag(F_ADC_BUTTON)){
				auto_off('Z', TM_200mS);
				Module_LCD_string(0, 2, "");				
				UART_WRITE(UART_LCD, run.key_now);
				if(run.key_now == '7') {run_function(FUC_ATTEND);}// run.gamemode_sw = 10;}
				if(run.key_now == '#') {run.gamemode_sw++;}// next
				time0_delay(TM_200mS);
				clrflag(F_ADC_BUTTON);				
			}	
			break;
			
		case 32: // chosung game again start 
			run_function(FUC_CHOSUNG); // CMD_GAMEMODE
			run.gamemode_sw++;// next		game mode
			debug=int(run.howmanystudent);
			UART_WRITE(UART_LCD, LCD_SCREEN_CLR); // all Screen Clear
		
			strcpy(mast.textlcd, "   student:     ");		
					
			ucpass = run.howmanystudent/10;
			mast.textlcd[11] = ucpass + 0x30;			
			ucpass = (run.howmanystudent - (ucpass*10));
			mast.textlcd[12] = ucpass + 0x30;			
			Module_LCD_string(0, 1, mast.textlcd);
			
		  
		
			strcpy(mast.textlcd, "N:");		
			Module_LCD_string(0, 2, mast.textlcd);				
		
			setflag(F_KEYBD_READ_OK); // able read key board
			auto_off('Z', TM_500mS);				
			break;
		
		
		case 33:// key in ini
			run.gamemode_sw++;// next		game mode
			setflag(F_KEYBD_READ_OK); // able read key board
			run.key_lcd_position = 2;
			run.ucpass=0;
			run.while_event = 1; 
			break;
		
		case 34:// chosung key in and display
			while(run.while_event){	
				cpass = run_processor_keyin_ret_ascii_chosung();
				if(cpass == '#'){ // exit
					run.gamemode_sw++;// next	
					run.while_event = 0;
					break;					
				}
				else if(cpass){ // key in
					if(cpass == '*'){ // key back
						run.key_lcd_position--;						
						run.ucpass--;
					}
					else{
						run.student_chosung_font[run.ucpass++] = run_processor_chosung_to_number(cpass);		
						Module_LCD_onebyte(run.key_lcd_position++, 2, cpass);
						
					}
				}
				
				if (isflag(F_IN15_BUTTON)){		// key board Calibration
					run.keyboard_adc = adc_read(ADC_KEY_CH, 32);// 2901; by jtag no KEY
					run_keyboard_define(run.keyboard_adc);
					// Hardware, OUT
					LEDRF(1);
					LEDBF(1);
					BUZZERF(1);
					time0_delay(TM_1000mS);
					LEDRF(0);
					LEDBF(0);
					BUZZERF(0);
					clrflag(F_IN15_BUTTON);
				}	
			}
		break;
		
		case 35:// display 					
			run.gamemode_sw++;// next		
			UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear
			//strcpy(mast.textlcd, "4:Attend 5:KEYBD");		
			strcpy(mast.textlcd, "7:Start  #:Again");		
			Module_LCD_string(0, 1, mast.textlcd);
			strcpy(mast.textlcd,"*:Main ");
			Module_LCD_string(9, 2, mast.textlcd);
			auto_off('Z', TM_500mS);		
			clrflag(F_ADC_BUTTON);
			setflag(F_KEYBD_READ_OK); // touch ON
			break;
		
		case 36: // send chosung random
					//run.howmanystudent
	//					run.student_chosung_font[run.key_lcd_position] = run_processor_chosung_to_number(cpass);		
				while(1){		
					if(isflag(F_ADC_BUTTON)){
						//run.gamemode_sw++;// result next		
						auto_off('Z', TM_200mS);
						Module_LCD_string(0, 2, "");				
						UART_WRITE(UART_LCD, run.key_now);
						if(run.key_now == '7'){ //  send infor

							run_function(FUC_CHOSUNG_FONT); // 
						}

						if(run.key_now == '#'){// 
							run.gamemode_sw = 30;// again game
							break;
						
						}
						if(run.key_now == '*'){// 
							run.gamemode_sw = 2;// GO main
							break;
						
						}
						time0_delay(TM_200mS);
						clrflag(F_ADC_BUTTON);				
					}	
				}
			break;		
		// END    *************   Chosung Game  ****************			
		
		// *************   X O Game  ****************
		case 10 : //X O Game Start, ini
			run.gamemode_sw++;// next		
			UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear
			//strcpy(mast.textlcd, "4:Attend 5:KEYBD");		
			strcpy(mast.textlcd, "7:Attend #:Next ");		
			Module_LCD_string(0, 1, mast.textlcd);
		
			// send game mode mast ==> student
			run_function(FUC_XOGAME);
			time0_delay(TM_500mS);	

			setflag(F_KEYBD_READ_OK); // able read key board
			auto_off('Z', TM_500mS);
		
			break;

		case 11:// check
			if(isflag(F_ADC_BUTTON)){
				auto_off('Z', TM_200mS);
				Module_LCD_string(0, 2, "");				
				UART_WRITE(UART_LCD, run.key_now);
				if(run.key_now == '7') {run_function(FUC_ATTEND);}// run.gamemode_sw = 10;}
				if(run.key_now == '#') {run.gamemode_sw++;}// next
				time0_delay(TM_200mS);
				clrflag(F_ADC_BUTTON);				
			}	
			break;
			
		case 12: // XO game again start 
			run.gamemode_sw++;// next		
			UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear
			//strcpy(mast.textlcd, "4:Attend 5:KEYBD");		
			strcpy(mast.textlcd, "4:10sec  6:20sec");		
			Module_LCD_string(0, 1, mast.textlcd);
		
			setflag(F_KEYBD_READ_OK); // able read key board
			auto_off('Z', TM_500mS);				
			break;
		
		case 13:// time out send
			if(isflag(F_ADC_BUTTON)){
				auto_off('Z', TM_200mS);
				Module_LCD_string(0, 2, "");				
				UART_WRITE(UART_LCD, run.key_now);
				
				if(run.key_now == '*'){ // system reset			
					run_function(FUC_REBOOT); // Reset
				}
					
				
