2023-ICTMentoring/Vest-firmware/MAST_NUC130_Code/FDe_Project_Master_V21_chosungError/NUC130LC1CN.c
				if(run.key_now == '4'){
					run.timeout_sec = run.senddata[0] = 10; //10 sec
					setflag(F_TIMEOUT_CHK_ING); // time out start					
					run_function(FUC_TIMEOUTTIME); // send all
					run.gamemode_sw++;// next
				}
					
				if(run.key_now == '6'){
					run.timeout_sec = run.senddata[0] = 20; //20 sec
					setflag(F_TIMEOUT_CHK_ING); // time out start
					run_function(FUC_TIMEOUTTIME); // send all
					run.gamemode_sw++;// next	
				}
				time0_delay(TM_200mS);
				clrflag(F_ADC_BUTTON);								
			}	
			break;		
			
		case 14:// display remain time
			run.gamemode_sw++;// next		
			UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear
			//strcpy(mast.textlcd, "4:Attend 5:KEYBD");		
			strcpy(mast.textlcd, "7:X 9:O  #:Again");		
			Module_LCD_string(0, 1, mast.textlcd);
		
			//setflag(F_KEYBD_READ_OK); // able read key board
			auto_off('Z', TM_500mS);		
			clrflag(F_KEYBD_READ_OK); // no touch
			
			break;
		
		case 15:
			//run.timeout_sec , unsigned long timeout_sec;// timeout
			

			if(ulpass != run.timeout_sec){
				ulpass = run.timeout_sec; // copy 
				//strcpy(mast.textlcd, "   student:     ");		
				strcpy(mast.textlcd, "   T:           ");		
				Module_LCD_string(0, 2, mast.textlcd);

			
				ucpass = run.timeout_sec/10;
				mast.textlcd[5] = ucpass + 0x30;
				
				ucpass = (run.timeout_sec - (ucpass*10));
				mast.textlcd[6] = ucpass + 0x30;
				
				Module_LCD_string(0, 2, mast.textlcd);
			}		
		
			if(isflag(F_TIMEOUT_OVER)){
				clrflag(F_TIMEOUT_OVER);
				setflag(F_KEYBD_READ_OK); // able read key board
				strcpy(mast.textlcd,"*:Main ");
				Module_LCD_string(9, 2, mast.textlcd);
			}
		
			if(isflag(F_ADC_BUTTON)){
				//run.gamemode_sw++;// result next		
				auto_off('Z', TM_200mS);
				Module_LCD_string(0, 2, "");				
				UART_WRITE(UART_LCD, run.key_now);
				if(run.key_now == '7'){ // X
					//if(run.student_OX_check == STU_X_BUTTON) strcpy(mast.textlcd, "  X:            ");		
					//if(run.student_OX_check == STU_O_BUTTON) strcpy(mast.textlcd, "  O:            ");	
					strcpy(mast.textlcd, "  X:            ");		
					Module_LCD_string(0, 2, mast.textlcd);		
					
					run.student_OX_check = STU_X_BUTTON;// 0x0F; // X
					run_function(FUC_READXO); // CMD_XO_REQ
				}
				if(run.key_now == '9'){ // O
					strcpy(mast.textlcd, "  O:            ");		
					Module_LCD_string(0, 2, mast.textlcd);		
					run.student_OX_check = STU_O_BUTTON;// 0xFB; // O
					run_function(FUC_READXO); // CMD_XO_REQ
				}				
				if(run.key_now == '#'){// again X O game 
					run.gamemode_sw = 12;// again X O 
				}
				if(run.key_now == '*'){// 
					run.gamemode_sw = 2;// GO main
						}
				time0_delay(TM_200mS);
				clrflag(F_ADC_BUTTON);				
			}	
			break;
	}// end switch
}

void run_function(unsigned char func){
	unsigned char number;
	
	switch(func){	
		case FUC_REBOOT :
			// Hardware Reset
			SYS_UnlockReg();
			SYS_ResetCPU();// Reset CPU 
			break;
		
		case FUC_TIMEOUTTIME :
			// send time out all student time out time SEC
			run_student_send(RF_ALLSTUDENT, CMD_TIME_OVER, 1); // all send game mode			
			break;
		
		case FUC_CHOSUNG :
			run.senddata[0] = GM_CHOSUNG;//chosung game mode
			run_student_send(RF_ALLSTUDENT, CMD_GAMEMODE, 1); // all send game mode
		break;
		
		case FUC_CHOSUNG_FONT : // 0x77		
			for(number = 0; number < run.howmanystudent; number++){
				run.senddata[0] = run.student_chosung_font[number];
				run_student_send(run.student_attend[number], CMD_CHOSUNG_FONT, 1); // 1 byte font each address game font
				time0_delay(TM_200mS);
			}
				
		break;		

		case FUC_XOGAME :
			run.senddata[0] = GM_XOGAME;//0x01;//Xo game mode
			run_student_send(RF_ALLSTUDENT, CMD_GAMEMODE, 1); // all send game mode
		break;

		case FUC_READXO : // X O result
		
			if(run.howmanystudent == 0) run.howmanystudent = MAX_ATTEND;
		
			for(ucpass=0; ucpass < run.howmanystudent; ucpass++){ // ping test and attend
				
				run_student_send(run.student_attend[ucpass], CMD_XO_REQ, 0); // CMD_XO_REQ
				
				time.com_check_rf = TM_200mS; // wait time
				setflag(F_STU_READ_TIMECHK);
				run.student_att_exit = 1; // endless loop exit timer
				while(run.student_att_exit){
					rf_3355_mast_read(); // 학생보드에서 OX결과 등 데이터를 보내면 읽는 함수
					if(isflag(F_RF_COM_OK)){
						clrflag(F_RF_COM_OK);
						if(run.student_OX_check == mast.readdata[0]){ // display
							number = run.student_attend[ucpass]/10;
							mast.textlcd[4] = number + 0x30;
							number = (run.student_attend[ucpass] - (number*10));
							mast.textlcd[5] = number + 0x30;
						
							Module_LCD_string(0, 2, mast.textlcd);		
							
							time0_delay(TM_1000mS); // display time
							time0_delay(TM_1000mS); // display time
						}
					
						clrflag(F_STU_READ_TIMECHK);
						run.student_att_exit = 0;//break;
						
					}
			
				}// end while
			}// end for
		strcpy(mast.textlcd,"*:Main ");
		Module_LCD_string(9, 2, mast.textlcd);	
		break;	
			
		case FUC_ATTEND : // unsigned char student_attend[MAX_ATTEND];// MAX_ATTEND, #define MAX_ATTEND		20// 최대 학생수, 참가자 출석표 작성
			run.howmanystudent =0;
			for(ucpass=0; ucpass < MAX_ATTEND; ucpass++){ // ping test and attend
				run_student_send(ucpass+1, CMD_PING, 0); // 1~20(0~19)
				time.com_check_rf = TM_200mS; // wait time
				setflag(F_STU_READ_TIMECHK);
				run.student_att_exit = 1; // endless loop exit timer
				while(run.student_att_exit){
					rf_3355_mast_read(); // 학생보드에서 OX결과 등 데이터를 보내면 읽는 함수
					if(isflag(F_RF_COM_OK)){
						clrflag(F_RF_COM_OK);
						run.student_attend[run.howmanystudent] = mast.add; // student address copy
						run.howmanystudent++;
						clrflag(F_STU_READ_TIMECHK);
						run.student_att_exit = 0;//break;
						
					}			
				}// end while
			}// end for
			//strcpy(mast.textlcd, "4:Attend 5:KEYBD");		
			  strcpy(mast.textlcd, "   student:     ");		
					
			ucpass = run.howmanystudent/10;
			mast.textlcd[11] = ucpass + 0x30;
			
			ucpass = (run.howmanystudent - (ucpass*10));
			mast.textlcd[12] = ucpass + 0x30;
			
			Module_LCD_string(0, 2, mast.textlcd);		
			
		break;	
		
