2023-ICTMentoring/Vest-firmware/MAST_NUC130_Code/FDe_Project_Master_V21_chosungError/NUC130LC1CN.c
		case FUC_KEY_CAL :
			UART_WRITE(UART_LCD, 0xC0); // 1100 0000 command format : all Screen Clear
			//strcpy(mast.textlcd, "4:Attend #:Next ");		
			strcpy(mast.textlcd, "Do not touch KEY");		
			Module_LCD_string(0, 2, mast.textlcd);
			time0_delay(TM_500mS);
			LEDRF(1);
			LEDBF(1);
			BUZZERF(1);
			time0_delay(TM_500mS);
			LEDRF(0);
			LEDBF(0);
			BUZZERF(0);				
		
			run.keyboard_adc = adc_read(ADC_KEY_CH, 32);// 2901; by jtag no KEY
			run_keyboard_define(run.keyboard_adc);
		break;		
		
	}
	
}

// Project Function ====================================
void run_keyboard_define(unsigned short adc_nokey){
	
	//0key 
	run.KEY[1] = (float)adc_nokey * (270.0 / (22.0 + 270.0)); // ex) no key ~ 1 KEY 2933 * 0.9 = 2720(1 key ADC)
	run.KEY[0] = adc_nokey - ((adc_nokey - run.KEY[1]) / 2); // NO KEY 2933 - (2933 - (1 key ADC))/2 
	
	// 1key
	run.KEY[2] = (float)adc_nokey * (200.0 / (22.0 + 200.0)); // ==> 2key ex) 1 Key ~ 2 key
	run.KEY[1] = run.KEY[1] - ((run.KEY[1] - run.KEY[2]) / 2); // (k1-k2)/2

	// 2key
	run.KEY[3] = (float)adc_nokey * (150.0 / (22.0 + 150.0)); // ==> +1
	run.KEY[2] = run.KEY[2] - ((run.KEY[2] - run.KEY[3]) / 2); // over this key
	
	// 3key
	run.KEY[4] = (float)adc_nokey * (100.0 / (22.0 + 100.0)); // ==> +1
	run.KEY[3] = run.KEY[3] - ((run.KEY[3] - run.KEY[4]) / 2); // over this key	
	
	// 4key
	run.KEY[5] = (float)adc_nokey * (66.0 / (22.0 + 66.0)); // ==> +1
	run.KEY[4] = run.KEY[4] - ((run.KEY[4] - run.KEY[5]) / 2); // over this key	
	
	// 5key
	run.KEY[6] = (float)adc_nokey * (47.0 / (22.0 + 47.0)); // ==> +1
	run.KEY[5] = run.KEY[5] - ((run.KEY[5] - run.KEY[6]) / 2); // over this key	
	
	// 6key
	run.KEY[7] = (float)adc_nokey * (32.0 / (22.0 + 32.0)); // ==> +1
	run.KEY[6] = run.KEY[6] - ((run.KEY[6] - run.KEY[7]) / 2); // over this key		
	
	// 7key
	run.KEY[8] = (float)adc_nokey * (22.0 / (22.0 + 22.0)); // ==> +1
	run.KEY[7] = run.KEY[7] - ((run.KEY[7] - run.KEY[8]) / 2); // over this key	

	// 8key
	run.KEY[9] = (float)adc_nokey * (14.7 / (22.0 + 14.7)); // ==> +1
	run.KEY[8] = run.KEY[8] - ((run.KEY[8] - run.KEY[9]) / 2); // over this key		
	
	// 9key
	run.KEY[10] = (float)adc_nokey * (10.0 / (22.0 + 10.0)); // ==> +1
	run.KEY[9] = run.KEY[9] - ((run.KEY[9] - run.KEY[10]) / 2); // over this key			
	
	// 10key
	run.KEY[11] = (float)adc_nokey * (6.7 / (22.0 + 6.7)); // ==> +1
	run.KEY[10] = run.KEY[10] - ((run.KEY[10] - run.KEY[11]) / 2); // over this key			
	
	// 11key
	run.KEY[12] = (float)adc_nokey * (4.7 / (22.0 + 4.7)); // ==> +1
	run.KEY[11] = run.KEY[11] - ((run.KEY[11] - run.KEY[12]) / 2); // over this key			
	
	run.KEY[12] = run.KEY[12] - ((run.KEY[11] - run.KEY[12])/2);
}

char run_processor_keyin_ret_ascii_chosung(void){
	char uc_ascii;
	unsigned char sw_no = 0;
	unsigned long keyin_wait_time;
	unsigned char con_wh;
	//unsigned char check_zero_button;
	
	if(isflag(F_ADC_BUTTON)){
		auto_off('Z', TM_200mS);
		if(run.key_now == '0'){
			time0_delay(TM_300mS);	
			clrflag(F_ADC_BUTTON);
			keyin_wait_time = TM_2000mS;
			timer0tick = 0; // time count ini
			con_wh = 1;
			sw_no = 10;
			while(con_wh){
				if(timer0tick > keyin_wait_time) {// nothing
					con_wh = 0; // exit
					sw_no = 0; 
					break;
				}
				if(isflag(F_ADC_BUTTON)){
					auto_off('Z', TM_200mS);
					if(run.key_now == '*') {
						sw_no = 30;
					}
					else if(run.key_now == '#') {
						sw_no = 40;
					}
					else{
						sw_no += run.key_now - '0'; // 10(0), 11 ~ 19   1    '*' 
					}
					clrflag(F_ADC_BUTTON);
					con_wh = 0; // exit
					break;
				}
			}
			
		}
		else if(('1' <= run.key_now) && (run.key_now <= '9')){
			sw_no = run.key_now - 0x30; // just number  0x30은 아스키코드로 '0'
		}
		else if(run.key_now == '*'){
			sw_no = 30;
		}
		else if(run.key_now == '#'){
			sw_no = 40;
		}

		time0_delay(TM_300mS);	
		clrflag(F_ADC_BUTTON);		
	}
	
	switch(sw_no){
		case 0:	uc_ascii = 0;		break; // no key board
		case 1:	uc_ascii = 'A';	break;		
		case 2:	uc_ascii = 'a';	break;		
		case 3:	uc_ascii = 'B';	break;		
		case 4:	uc_ascii = 'C';	break;		
		case 5:	uc_ascii = 'c';	break;		
		case 6:	uc_ascii = 'D';	break;		
		case 7:	uc_ascii = 'E';	break;		
		case 8:	uc_ascii = 'F';	break;		
		case 9:	uc_ascii = 'f';	break;		
		case 10:	uc_ascii = 'G';	break;		
		case 11:	uc_ascii = 'g';	break;		
		case 12:	uc_ascii = 'H';	break;		
		case 13:	uc_ascii = 'J';	break;		
		case 14:	uc_ascii = 'j';	break;		
		case 15:	uc_ascii = 'K';	break;		
		case 16:	uc_ascii = 'L';	break;		
		case 17:	uc_ascii = 'M';	break;		
		case 18:	uc_ascii = 'N';	break;		
		case 19:	uc_ascii = 'O';	break;		
		case 30:	uc_ascii = '*';	break;		
		case 40:	uc_ascii = '#';	break;		
	}
	return uc_ascii;
}

unsigned char run_processor_chosung_to_number(char chosung_ascii){
	unsigned char ucret_num;
	
	switch(chosung_ascii){
		case 0:		ucret_num = 0;	break; // no key board
		case 'A':	ucret_num = 1;	break;		
		case 'a':	ucret_num = 2;	break;		
		case 'B':	ucret_num = 3;	break;		
		case 'C':	ucret_num = 4;	break;		
		case 'c':	ucret_num = 5;	break;		
		case 'D':	ucret_num = 6;	break;		
		case 'E':	ucret_num = 7;	break;		
		case 'F':	ucret_num = 8;	break;		
		case 'f':	ucret_num = 9;	break;		
		case 'G':	ucret_num = 10;	break;		
		case 'g':	ucret_num = 11;	break;		
		case 'H':	ucret_num = 12;	break;		
		case 'J':	ucret_num = 13;	break;		
		case 'j':	ucret_num = 14;	break;		
		case 'K':	ucret_num = 15;	break;		
		case 'L':	ucret_num = 16;	break;		
		case 'M':	ucret_num = 17;	break;	
		case 'N':	ucret_num = 18;	break;	
		case 'O':	ucret_num = 19;	break;	
	}
	return ucret_num;	
}

char run_keyboard_adc_return(unsigned short adc_key){
	char key_information = 0;

	if (adc_key < run.KEY[0]){ // key in
		if (adc_key > run.KEY[1])		return ('1');
		if (adc_key > run.KEY[2])		return ('2');
		if (adc_key > run.KEY[3])		return ('3');
		if (adc_key > run.KEY[4])		return ('4');
		if (adc_key > run.KEY[5])		return ('5');
		if (adc_key > run.KEY[6])		return ('6');
		
		if (adc_key > run.KEY[7])		return ('7');
		if (adc_key > run.KEY[8])		return ('8');
		if (adc_key > run.KEY[9])		return ('9');
		if (adc_key > run.KEY[10])		return ('*');
		if (adc_key > run.KEY[11])		return ('0');
		if (adc_key > run.KEY[12])		return ('#');
	}
	return key_information;
}

void run_student_send(unsigned char add, unsigned char cmd, unsigned char datalen)
{
	unsigned char senco;
	unsigned char sendsum;

	UART_WRITE(UART_RF, RF_MAST_PREAMBLE); // start  1

	sendsum = add;			  // address
	UART_WRITE(UART_RF, add); // 2

	sendsum += cmd;			  // command
	UART_WRITE(UART_RF, cmd); // 3

	for (senco = 0; senco < datalen; senco++)
	{ // if datalen is zero not use
		sendsum += run.senddata[senco];
		UART_WRITE(UART_RF, run.senddata[senco]); // data
	}
	UART_WRITE(UART_RF, sendsum); // 4

	UART_WRITE(UART_RF, TAIL); // 5
}

unsigned char run_student_receive_checksum(unsigned char datalen)
{
	unsigned char ret_sum;
	unsigned char i;

	ret_sum = mast.add;		 // 1
	ret_sum += mast.command; // 2
	for (i = 0; i < datalen; i++)
	{ // if datalen is zero not use
		ret_sum += mast.readdata[i];
	}
	return ret_sum;
}

unsigned char check_pop(void)
{
	if (rf.wp != rf.rp)
	{
		mast.get_char = (rf.buffer[rf.rp]);
		rf.rp++;
		if (rf.rp > QSIZE)
			rf.rp = 0; // Read ��������
		return 1;
	} // end if
	return 0;
} // end check_pop


void rf_3355_mast_read(void){
	if(check_pop()){
		setflag(F_RF_TIME);
		mast.comtimeout = 0; // @1 sec
		switch (mast.sequence)
		{
		case 0:
			if (mast.get_char == RF_STUDENT_PREAMBLE) { // header 1 // 0x80
				mast.sequence += 2;
			}
			break;
			
		case 2: // 
			mast.add = mast.get_char;
			mast.sequence += 2;	
			break;
		
		case 4:
			mast.command = mast.get_char; // cmd
			if ((mast.command == (CMD_PING | RF_OR0x80)) || (mast.command == (CMD_XO_REQ | RF_OR0x80))){ // 1byte
				mast.len = 1;
				mast.count = 0; // real data Start @sens_data
				mast.sequence += 2;
			}
			else
			{ // no data
				mast.len = 0;
				mast.sequence = 50; // end
			}
			break;

		case 6:
			mast.readdata[mast.count++] = mast.get_char; //
			if (mast.count >= mast.len)
			{						// 1 >=
				mast.sequence = 50; // end
			}
			break;

		case 50: // check sum
			mast.sum = mast.get_char;
			mast.sequence = 54;
			break;
		case 54: // 0D check
			if (mast.get_char == TAIL){
				if (mast.sum == run_student_receive_checksum(mast.len))
				{
					setflag(F_RF_COM_OK);
				}
			}
			clrflag(F_RF_TIME);
			mast.sequence = 0; // home
			break;
		}
	}
}
